src/main/resources/samples/terminate-contract.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                 xmlns:ns2="http://10.61.40.133/shep/bip-sync-wss-gost/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:ContractSyncRequest>
         <ns2:RequestInfo>
            <ns2:RequestId>REQ-2025-003</ns2:RequestId>
            <ns2:Timestamp>2025-05-30T15:30:00</ns2:Timestamp>
            <ns2:SourceSystem>ESUTD</ns2:SourceSystem>
         </ns2:RequestInfo>
         <ns2:ContractData>
            <ns2:Operation>TERMINATE_CONTRACT</ns2:Operation>
            <ns2:TerminationInfo>
               <ns2:ContractId>CTR-2025-100</ns2:ContractId>
               <ns2:TerminationDate>2025-06-15</ns2:TerminationDate>
               <ns2:TerminationReason>По соглашению сторон</ns2:TerminationReason>
               <ns2:TerminationReasonCode>01</ns2:TerminationReasonCode>
            </ns2:TerminationInfo>
         </ns2:ContractData>
      </ns2:ContractSyncRequest>
   </soapenv:Body>
</soapenv:Envelope>